<p><span style="font-size:16pt"><span style="font-family:&quot;Calibri Light&quot;,sans-serif"><span style="color:#2f5496">Use case 2&nbsp; &ndash; Automatick&aacute; prevence ransomware</span></span></span></p>

<p><strong>V &uacute;vodn&iacute; lev&eacute; č&aacute;sti SUMMARY n&aacute;m ReaQta ukazuje, že se jednalo o nepodepsanou aplikace maze_rw.exe, kter&aacute; se chovala jako ransomware.</strong></p>

<p>Pro m&eacute;ně zku&scaron;en&eacute; oper&aacute;tory dod&aacute;v&aacute; vysvětlen&iacute;, že ransomware je typ programů, kter&yacute; za&scaron;ifruje ve&scaron;ker&aacute; data na zař&iacute;zen&iacute; a n&aacute;sledně požaduje v&yacute;kupn&eacute; za poskytnut&iacute; kl&iacute;če pro roz&scaron;ifrov&aacute;n&iacute; dat. V živ&eacute; verzi ReaQty můžete tak&eacute; doplnit sv&eacute; pozn&aacute;mky tlač&iacute;tkem ADD NOTES.</p>

<p>V prav&eacute; horn&iacute; č&aacute;sti <strong>STATUS</strong> ř&iacute;k&aacute;, že již do&scaron;lo k zastaven&iacute; v&scaron;ech &scaron;kodliv&yacute;ch procesů souvisej&iacute;c&iacute;ch s t&iacute;mto Alertem.</p>

<p>V č&aacute;stech n&iacute;že si můžete prohl&eacute;dnout dal&scaron;&iacute; detaily:</p>

<p><strong>AFFECTED ENDPOINT</strong> - &uacute;daje o dotčen&eacute; koncov&eacute; stanici. Tlač&iacute;tka LIVE RESPONSE, COLLECT FORENSIC DATA a ISOLATE si bl&iacute;že rozebereme později.</p>

<p><strong>BEHAVIORAL TREE</strong> - strom chov&aacute;n&iacute; s kl&iacute;čov&yacute;mi ud&aacute;lostmi a procesy.</p>

<p><strong>INFRASTRUCTURE ARTIFACTS</strong> - stejn&yacute; probl&eacute;m se objevil tak&eacute; u dal&scaron;&iacute;ho zař&iacute;zen&iacute; v infrastruktuře.</p>

<p><strong>CLOUD ANALYSIS SCORE</strong> - dotyčn&yacute; soubor byl zanalyzov&aacute;n a označen jako infikovan&yacute;. Soubor se d&aacute; tak&eacute; st&aacute;hnout k dal&scaron;&iacute;mu zkoum&aacute;n&iacute;, nebo &quot;lovit&quot; jeho stopy v cel&eacute; infrastruktuře.</p>

<p><strong>POLICIES</strong> - pokud byste měli přednastaven&eacute; politiky pro dan&yacute; typ hrozeb, byly by zobrazeny. Zde je tak&eacute; možnost zařadit tento Alert do b&iacute;l&eacute; (vždy povolit) nebo čern&eacute; listiny (vždy blokovat) do budoucna.</p>

<p><strong>MITRE ATT&amp;CK</strong> - jak&eacute; taktiky a techniky v r&aacute;mci MITRE ATT&amp;CK Frameworku byly použity.</p>

<p><strong>EVENTS</strong> - podrobn&yacute; log se v&scaron;emi souvisej&iacute;c&iacute;mi ud&aacute;lostmi. V&scaron;imněte si, že červeně je označen ř&aacute;dek s kl&iacute;čovou &scaron;kodlivou ud&aacute;lost&iacute;.</p>

<p>V <strong>živ&eacute; verzi </strong>ReaQty je možn&eacute; jednotliv&eacute; <strong>ř&aacute;dky rozkliknout </strong>do vět&scaron;&iacute;ho <strong>detailu</strong>. V&yacute;sledky je tak&eacute; možn&eacute; filtrovat a exportovat např. pro bezpečnostn&iacute; analytiky nebo vy&scaron;etřovatele.</p>

<p><u><strong>Nyn&iacute; </strong>se <strong>vraťte nahoru </strong>do č&aacute;sti <strong>AFFECTED ENDPOINT </strong>a <strong>klikněte </strong>na <strong>tlač&iacute;tko COLLECT FORENSIC DATA</strong>.</u></p>
